[{"tvdb_id":250487,"imdb_id":"tt1844624","overview":"American Horror Story is a horror-drama television franchise created and produced by Ryan Murphy and Brad Falchuk. Described as an anthology series, each season is conceived as a self-contained miniseries, following a disparate set of characters and settings, and a storyline with its own \"beginning, middle and end\".","title":"American Horror Story","banner":"http:\/\/thetvdb.com\/banners\/_cache\/graphical\/250487-g27.jpg","fanart":"http:\/\/thetvdb.com\/banners\/_cache\/fanart\/original\/250487-25.jpg","poster":"http:\/\/thetvdb.com\/banners\/_cache\/posters\/250487-38.jpg"},{"tvdb_id":257655,"imdb_id":"tt2193021","overview":"Oliver Queen and his father are lost at sea when their luxury yacht sinks. His father doesn't survive. Oliver survives on an uncharted island for five years learning to fight, but also learning about his father's corruption and unscrupulous business dealings. He returns to civilization a changed man, determined to put things right. He disguises himself with the hood of one of his mysterious island mentors, arms himself with a bow and sets about hunting down the men and women who have corrupted his city.","title":"Arrow","banner":"http:\/\/thetvdb.com\/banners\/_cache\/graphical\/257655-g9.jpg","fanart":"http:\/\/thetvdb.com\/banners\/_cache\/fanart\/original\/257655-47.jpg","poster":"http:\/\/thetvdb.com\/banners\/_cache\/posters\/257655-25.jpg"},{"tvdb_id":248596,"imdb_id":"tt2705602","overview":"A fantasy drama set in a world of legendary heroes and mythical creatures. Far from home and desperate for answers, Jason washes up on the shores of an ancient land. A mysterious place; a world of bull leaping, of snake haired goddesses and of palaces so vast it was said they were built by giants - this is the city of Atlantis. Aided by his two new friends, Pythagoras and Hercules, Jason embarks on a voyage of discovery, and salvation, which sees him brush shoulders with Medusa, come face to face with the Minotaur and even do battle with the dead.","title":"Atlantis (2013)","banner":"http:\/\/thetvdb.com\/banners\/_cache\/graphical\/248596-g4.jpg","fanart":"http:\/\/thetvdb.com\/banners\/_cache\/fanart\/original\/248596-1.jpg","poster":"http:\/\/thetvdb.com\/banners\/_cache\/posters\/248596-6.jpg"},{"tvdb_id":259765,"imdb_id":"tt2017109","overview":"An unnamed ex-convict assumes the identity of Lucas Hood the sheriff of Banshee, Pennsylvania, where he, behind a badge, continues his criminal activities, even as he’s hunted by the shadowy gangsters he betrayed years earlier.","title":"Banshee","banner":"http:\/\/thetvdb.com\/banners\/_cache\/graphical\/259765-g2.jpg","fanart":"http:\/\/thetvdb.com\/banners\/_cache\/fanart\/original\/259765-12.jpg","poster":"http:\/\/thetvdb.com\/banners\/_cache\/posters\/259765-9.jpg"},{"tvdb_id":258171,"imdb_id":"tt1954347","overview":"Kiera Cameron (Rachel Nichols), a Vancouver City Protective Services officer, is transported from the year 2077 to 2012 when eight ruthless terrorists, known as Liber8, attempt to escape execution through time travel. With the help of 17 year old tech genius Alec Sadler (Erik Knudsen) and VPD officer Carlos Fonnegra (Victor Webster), Kiera must survive in our time period, and capture Liber8 before they can alter the course of history and change the future.","title":"Continuum","banner":"http:\/\/thetvdb.com\/banners\/_cache\/graphical\/258171-g9.jpg","fanart":"http:\/\/thetvdb.com\/banners\/_cache\/fanart\/original\/258171-11.jpg","poster":"http:\/\/thetvdb.com\/banners\/_cache\/posters\/258171-5.jpg"},{"tvdb_id":259669,"imdb_id":"tt2094262","overview":"The series follows the \"untold\" story of Leonardo Da Vinci: the genius during his early years in Renaissance Florence. As a 25-year old artist, inventor, swordsman, lover, dreamer and idealist, he struggles to live within the confines of his own reality and time as he begins to not only see the future, but invent it. ","title":"Da Vinci's Demons","banner":"http:\/\/thetvdb.com\/banners\/_cache\/graphical\/259669-g2.jpg","fanart":"http:\/\/thetvdb.com\/banners\/_cache\/fanart\/original\/259669-7.jpg","poster":"http:\/\/thetvdb.com\/banners\/_cache\/posters\/259669-4.jpg"},{"tvdb_id":255316,"imdb_id":"tt2191671","overview":"Following his fall from grace in London and a stint in rehab, eccentric Sherlock escapes to Manhattan where his wealthy father forces him to live with his worst nightmare – a sober companion, Dr. Watson. A successful surgeon until she lost a patient and her license three years ago, Watson views her current job as another opportunity to help people, as well as paying a penance. Holmes resumes his work as a police consultant in New York City and Watson has no choice but to accompany her irascible new charge on his jobs. But Sherlock finds her medical background helpful, and Watson realizes she has a knack for playing investigator.\n\nWith the mischievous Sherlock Holmes now running free in New York solving crimes, it’s simple deduction that he’s going to need someone to keep him grounded, and it’s elementary that it’s a job for Watson.","title":"Elementary","banner":"http:\/\/thetvdb.com\/banners\/_cache\/graphical\/255316-g12.jpg","fanart":"http:\/\/thetvdb.com\/banners\/_cache\/fanart\/original\/255316-33.jpg","poster":"http:\/\/thetvdb.com\/banners\/_cache\/posters\/255316-16.jpg"},{"tvdb_id":205281,"imdb_id":"tt1462059","overview":"The series tells the story of the aftermath of a global invasion by several races of extraterrestrials that neutralizes the world's power grid and technology, quickly destroys the combined militaries of all the world's countries, and apparently kills over 90% of the human population within a few days.","title":"Falling Skies","banner":"http:\/\/thetvdb.com\/banners\/_cache\/graphical\/205281-g10.jpg","fanart":"http:\/\/thetvdb.com\/banners\/_cache\/fanart\/original\/205281-25.jpg","poster":"http:\/\/thetvdb.com\/banners\/_cache\/posters\/205281-10.jpg"},{"tvdb_id":269613,"imdb_id":"tt2802850","overview":"From the Coen brothers is a fresh story spun out of the world of the Oscar-winning film. A drifter named Lorne Malvo arrives in small-town Minnesota and influences the population with his malice and violence, including put-upon insurance salesman Lester Nygaard. The all new \"true crime\" case of Fargo's new chapter travels back to 1979 in Sioux Falls, South Dakota and Luverne, Minnesota, where a young State Police Officer investigates a case involving a local crime gang and a major Mob syndicate.","title":"Fargo","banner":"http:\/\/thetvdb.com\/banners\/_cache\/graphical\/269613-g5.jpg","fanart":"http:\/\/thetvdb.com\/banners\/_cache\/fanart\/original\/269613-11.jpg","poster":"http:\/\/thetvdb.com\/banners\/_cache\/posters\/269613-2.jpg"},{"tvdb_id":290853,"imdb_id":"tt3743822","overview":"A horrifying zombiocalypse spin-off series from The Walking Dead, set in the same universe but starting at a far earlier time time in Los Angeles. The show follows normal people learning to deal with the rapidly growing collapse of civilisation, at the very beginning of a zombie outbreak.\n\nIn Los Angeles, a city where people come to escape, shield secrets, and bury their pasts, we follow this mysterious outbreak as it threatens to disrupt what little stability high school guidance counselor Madison Clark and English teacher Travis Manawa have managed to assemble. \n\nThe pressure of blending two families while dealing with resentful, escapist, and strung out children takes a back seat when society begins to break down. A forced evolution, and survival of the fittest takes hold, as our dysfunctional family finds they must either reinvent themselves or embrace their darker histories.","title":"Fear the Walking Dead","banner":"http:\/\/thetvdb.com\/banners\/_cache\/graphical\/290853-g2.jpg","fanart":"http:\/\/thetvdb.com\/banners\/_cache\/fanart\/original\/290853-10.jpg","poster":"http:\/\/thetvdb.com\/banners\/_cache\/posters\/290853-6.jpg"},{"tvdb_id":121361,"imdb_id":"tt0944947","overview":"Seven noble families fight for control of the mythical land of Westeros. Friction between the houses leads to full-scale war. All while a very ancient evil awakens in the farthest north. Amidst the war, a neglected military order of misfits, the Night's Watch, is all that stands between the realms of men and the icy horrors beyond.","title":"Game of Thrones","banner":"http:\/\/thetvdb.com\/banners\/_cache\/graphical\/121361-g19.jpg","fanart":"http:\/\/thetvdb.com\/banners\/_cache\/fanart\/original\/121361-83.jpg","poster":"http:\/\/thetvdb.com\/banners\/_cache\/posters\/121361-34.jpg"},{"tvdb_id":248736,"imdb_id":"tt1830617","overview":"Nick Burkhardt thought he prepared himself for the realities of working as a homicide detective until he started seeing things he couldn't explain. Nick's life turns upside down when his Aunt Marie reveals they are descendants of an elite group of hunters,  known as \"Grimms,\" who fight to keep humanity safe from supernatural creatures. As Nick digs deeper into her past, he realizes that he will have to shoulder the responsibility of his ancestors.","title":"Grimm","banner":"http:\/\/thetvdb.com\/banners\/_cache\/graphical\/248736-g14.jpg","fanart":"http:\/\/thetvdb.com\/banners\/_cache\/fanart\/original\/248736-13.jpg","poster":"http:\/\/thetvdb.com\/banners\/_cache\/posters\/248736-1.jpg"},{"tvdb_id":259063,"imdb_id":"tt2243973","overview":"Both a gift and a curse, Will Graham has the extraordinary ability to think like his prey—he sees what they see, feels what they feel. But while Graham is pursuing an especially troubling, cannibalistic murderer, Special Agent Jack Crawford teams him with a highly respected psychiatrist – a man with a taste for the criminal minded – Dr. Hannibal Lecter.","title":"Hannibal","banner":"http:\/\/thetvdb.com\/banners\/_cache\/graphical\/259063-g9.jpg","fanart":"http:\/\/thetvdb.com\/banners\/_cache\/fanart\/original\/259063-50.jpg","poster":"http:\/\/thetvdb.com\/banners\/_cache\/posters\/259063-17.jpg"},{"tvdb_id":247897,"imdb_id":"tt1796960","overview":"It has been 2 years since the events in Pakistan. Carrie Mathison has left the CIA and is working as head of security for the philanthrophic Düring Foundation and residing in Berlin, Germany. Two hackers from Berlin accidentally gain access to the CIA network and get their hands on sensitive documents regarding Germany allowing the CIA to snoop on German citizens.\n","title":"Homeland","banner":"http:\/\/thetvdb.com\/banners\/_cache\/text\/247897-4.jpg","fanart":"http:\/\/thetvdb.com\/banners\/_cache\/fanart\/original\/247897-27.jpg","poster":"http:\/\/thetvdb.com\/banners\/_cache\/posters\/247897-17.jpg"},{"tvdb_id":262980,"imdb_id":"tt1856010","overview":"Ruthless and cunning, Congressman Francis Underwood and his wife Claire stop at nothing to conquer everything. This wicked political drama penetrates the shadowy world of greed, sex and corruption in modern D.C.","title":"House of Cards (US)","banner":"http:\/\/thetvdb.com\/banners\/_cache\/graphical\/262980-g5.jpg","fanart":"http:\/\/thetvdb.com\/banners\/_cache\/fanart\/original\/262980-5.jpg","poster":"http:\/\/thetvdb.com\/banners\/_cache\/posters\/262980-3.jpg"},{"tvdb_id":261557,"imdb_id":"tt2137109","overview":"MASTERS OF SEX stars Michael Sheen and Lizzy Caplan, who portray the real-life pioneers of the science of human sexuality, William Masters and Virginia Johnson. The series chronicles the unusual lives, romance and pop culture trajectory of Masters and Johnson. Their research touched off the sexual revolution and took them from a mid-western teaching hospital in St. Louis to the cover of Time magazine.","title":"Masters of Sex","banner":"http:\/\/thetvdb.com\/banners\/_cache\/graphical\/261557-g8.jpg","fanart":"http:\/\/thetvdb.com\/banners\/_cache\/fanart\/original\/261557-12.jpg","poster":"http:\/\/thetvdb.com\/banners\/_cache\/posters\/261557-6.jpg"},{"tvdb_id":289590,"imdb_id":"tt4158110","overview":"The show follows Elliot, who is a cyber-security tech by day and vigilante hacker by night. He has used his hacking skills for justice and to protect those he cares about, but has problems connecting to people in the real world due to social anxiety. He strongly believes that the world is being ruled by the 1% of the 1% and, that using money and debt, they have enslaved mankind and he wishes desperately to change this. He is recruited by the head of a highly secret hacking group to take down the corporation he is being paid to protect with the hope of erasing 70% of all the debt in the world. He has had delusions in the past and sees a therapist who tries to help him and takes medication for it, but in the end he is unsure what is real and what is not, and so are we as we experience everything from his perspective.","title":"Mr. Robot","banner":"http:\/\/thetvdb.com\/banners\/_cache\/graphical\/289590-g7.jpg","fanart":"http:\/\/thetvdb.com\/banners\/_cache\/fanart\/original\/289590-2.jpg","poster":"http:\/\/thetvdb.com\/banners\/_cache\/posters\/289590-3.jpg"},{"tvdb_id":282670,"imdb_id":"tt2707408","overview":"A chronicled look at the criminal exploits of Colombian drug lord Pablo Escobar and the Medellín Cartel.","title":"Narcos","banner":"http:\/\/thetvdb.com\/banners\/_cache\/graphical\/282670-g.jpg","fanart":"http:\/\/thetvdb.com\/banners\/_cache\/fanart\/original\/282670-5.jpg","poster":"http:\/\/thetvdb.com\/banners\/_cache\/posters\/282670-9.jpg"},{"tvdb_id":259866,"imdb_id":"tt2249007","overview":"Set in the sprawling mecca of the rich and famous, Ray Donovan does the dirty work for LA's top power players. He is the go-to guy who makes the problems of the city's celebrities, superstar athletes, and business moguls disappear. This powerful drama unfolds when his father is unexpectedly released from prison, setting off a chain of events that shakes the Donovan family to its core.","title":"Ray Donovan","banner":"http:\/\/thetvdb.com\/banners\/_cache\/graphical\/259866-g4.jpg","fanart":"http:\/\/thetvdb.com\/banners\/_cache\/fanart\/original\/259866-14.jpg","poster":"http:\/\/thetvdb.com\/banners\/_cache\/posters\/259866-4.jpg"},{"tvdb_id":260485,"imdb_id":"tt2183641","overview":"A drama set in the East End of London in 1889, during the aftermath of the \"Ripper\" murders. The action centres around the notorious H Division – the police precinct from hell – which is charged with keeping order in the chaotic streets of Whitechapel.\n\nRipper Street explores the lives of characters trying to recover from the Ripper's legacy, from crimes that have not only irretrievably altered their lives, but the very fabric of their city. At the drama's heart our detectives try to bring a little light into the dark world they inhabit.","title":"Ripper Street","banner":"http:\/\/thetvdb.com\/banners\/_cache\/graphical\/260485-g3.jpg","fanart":"http:\/\/thetvdb.com\/banners\/_cache\/fanart\/original\/260485-4.jpg","poster":"http:\/\/thetvdb.com\/banners\/_cache\/posters\/260485-9.jpg"},{"tvdb_id":295980,"imdb_id":"tt2492296","overview":"Based on True Events, Mayor Nick Wasicsko took office in 1987 during Yonkers' worst crisis. As penance for previous misuse of federal housing funds, a federal court orders low-income public housing built in the city's wealthier white neighborhoods. The city threatens to tear itself apart and destroy Nick in the process, in a bitter battle fueled by fear, racism, murder and politics. \n\nFrom The Wire co-creator David Simon.\n","title":"Show Me a Hero","banner":"http:\/\/thetvdb.com\/banners\/_cache\/graphical\/295980-g.jpg","fanart":"http:\/\/thetvdb.com\/banners\/_cache\/fanart\/original\/295980-1.jpg","poster":"http:\/\/thetvdb.com\/banners\/_cache\/posters\/295980-2.jpg"},{"tvdb_id":269578,"imdb_id":"tt2647544","overview":"Ichabod Crane awakes from the throes of death 250 years in the future where he must solve a mystery dating back to the founding fathers. Due to a blood spell cast on a battlefield during the Revolution, the infamous headless horseman is revived along with Crane, and the murderous rider embarks on a bloody rampage in present-day Sleepy Hollow. Ichabod realizes that he must act quickly, for the headless horseman is only the first of the Four Horsemen of the Apocalypse. Detective Abbie Mills, a woman familiar with supernatural experiences, forms a bond with Crane as they try to stop an increasingly vicious cycle of evil.","title":"Sleepy Hollow","banner":"http:\/\/thetvdb.com\/banners\/_cache\/graphical\/269578-g9.jpg","fanart":"http:\/\/thetvdb.com\/banners\/_cache\/fanart\/original\/269578-18.jpg","poster":"http:\/\/thetvdb.com\/banners\/_cache\/posters\/269578-5.jpg"},{"tvdb_id":261690,"imdb_id":"tt2149175","overview":"The Americans is a period drama about the complex marriage of two KGB spies posing as Americans in suburban Washington D.C. shortly after Ronald Reagan is elected President. The arranged marriage of Philip and Elizabeth Jennings, who have two children - 13-year-old Paige and 10-year-old Henry, who know nothing about their parents' true identity - grows more passionate and genuine by the day, but is constantly tested by the escalation of the Cold War and the intimate, dangerous and darkly funny relationships they must maintain with a network of spies and informants under their control.","title":"The Americans (2013)","banner":"http:\/\/thetvdb.com\/banners\/_cache\/graphical\/261690-g5.jpg","fanart":"http:\/\/thetvdb.com\/banners\/_cache\/fanart\/original\/261690-11.jpg","poster":"http:\/\/thetvdb.com\/banners\/_cache\/posters\/261690-8.jpg"},{"tvdb_id":279977,"imdb_id":"tt2937900","overview":"Set in downtown New York in 1900, 'The Knick' is a new Cinemax drama series from Academy Award and Emmy-winning director Steven Soderbergh. It is centered on the Knickerbocker Hospital and the groundbreaking surgeons, nurses and staff who work there, pushing the bounds of medicine in a time of astonishingly high mortality rates and zero antibiotics. ","title":"The Knick","banner":"http:\/\/thetvdb.com\/banners\/_cache\/graphical\/279977-g3.jpg","fanart":"http:\/\/thetvdb.com\/banners\/_cache\/fanart\/original\/279977-5.jpg","poster":"http:\/\/thetvdb.com\/banners\/_cache\/posters\/279977-2.jpg"},{"tvdb_id":269533,"imdb_id":"tt2402207","overview":"Their mission is simple: Find a cure. Stop the virus. Save the world. When a global pandemic wipes out eighty percent of the planet's population, the crew of a lone naval destroyer must find a way to pull humanity from the brink of extinction. Executive Producer Michael Bay presents The Last Ship, starring Eric Dane, Rhona Mitra and Adam Baldwin.","title":"The Last Ship","banner":"http:\/\/thetvdb.com\/banners\/_cache\/graphical\/269533-g4.jpg","fanart":"http:\/\/thetvdb.com\/banners\/_cache\/fanart\/original\/269533-14.jpg","poster":"http:\/\/thetvdb.com\/banners\/_cache\/posters\/269533-4.jpg"},{"tvdb_id":276564,"imdb_id":"tt2654620","overview":"The Strain is a high concept thriller that tells the story of Dr. Ephraim Goodweather, the head of the Center for Disease Control Canary Team in New York City. He and his team are called upon to investigate a mysterious viral outbreak with hallmarks of an ancient and evil strain of vampirism. As the strain spreads, Eph, his team, and an assembly of everyday New Yorkers, wage war for the fate of humanity itself.","title":"The Strain","banner":"http:\/\/thetvdb.com\/banners\/_cache\/graphical\/276564-g10.jpg","fanart":"http:\/\/thetvdb.com\/banners\/_cache\/fanart\/original\/276564-31.jpg","poster":"http:\/\/thetvdb.com\/banners\/_cache\/posters\/276564-5.jpg"},{"tvdb_id":153021,"imdb_id":"tt1520211","overview":"The world we knew is gone. An epidemic of apocalyptic proportions has swept the globe causing the dead to rise and feed on the living. In a matter of months society has crumbled. In a world ruled by the dead, we are forced to finally start living. Based on a comic book series of the same name by Robert Kirkman, this AMC project focuses on the world after a zombie apocalypse. The series follows a police officer, Rick Grimes, who wakes up from a coma to find the world ravaged with zombies. Looking for his family, he and a group of survivors attempt to battle against the zombies in order to stay alive.\n","title":"The Walking Dead","banner":"http:\/\/thetvdb.com\/banners\/_cache\/graphical\/153021-g43.jpg","fanart":"http:\/\/thetvdb.com\/banners\/_cache\/fanart\/original\/153021-46.jpg","poster":"http:\/\/thetvdb.com\/banners\/_cache\/posters\/153021-31.jpg"},{"tvdb_id":270633,"imdb_id":"tt2356777","overview":"An anthology series in which police investigations unearth the personal and professional secrets of those involved, both within and outside the law.","title":"True Detective","banner":"http:\/\/thetvdb.com\/banners\/_cache\/graphical\/270633-g7.jpg","fanart":"http:\/\/thetvdb.com\/banners\/_cache\/fanart\/original\/270633-10.jpg","poster":"http:\/\/thetvdb.com\/banners\/_cache\/posters\/270633-3.jpg"},{"tvdb_id":264492,"imdb_id":"tt1553656","overview":"An invisible and mysterious force field descends upon a small fictional town in the United States, trapping residents inside, cut off from the rest of civilization. The trapped townsfolk must discover the secrets and purpose of the \"dome\" and its origins, while coming to learn more than they ever knew about each other.","title":"Under the Dome","banner":"http:\/\/thetvdb.com\/banners\/_cache\/graphical\/264492-g4.jpg","fanart":"http:\/\/thetvdb.com\/banners\/_cache\/fanart\/original\/264492-2.jpg","poster":"http:\/\/thetvdb.com\/banners\/_cache\/posters\/264492-2.jpg"},{"tvdb_id":260449,"imdb_id":"tt2306299","overview":"Vikings follows the adventures of Ragnar Lothbrok the greatest hero of his age. The series tells the sagas of Ragnar's band of Viking brothers and his family, as he rises to become King of the Viking tribes. As well as being a fearless warrior, Ragnar embodies the Norse traditions of devotion to the gods, legend has it that he was a direct descendant of Odin, the god of war and warriors.","title":"Vikings","banner":"http:\/\/thetvdb.com\/banners\/_cache\/graphical\/260449-g13.jpg","fanart":"http:\/\/thetvdb.com\/banners\/_cache\/fanart\/original\/260449-15.jpg","poster":"http:\/\/thetvdb.com\/banners\/_cache\/posters\/260449-8.jpg"},{"tvdb_id":280494,"imdb_id":"tt3843168","overview":"Z Nation is a dynamic ensemble drama that will plunge viewers into a fully-imagined, post-zombie America and take them on adventures with a diverse group of richly-drawn characters. Getting to know the reluctant heroes, their flaws, idiosyncrasies, and moral dilemmas will ultimately become the heart of the show.\n\nZ Nation starts three years after the zombie virus has gutted the country, a team of everyday heroes must transport the only known survivor of the plague from New York to California, where the last functioning viral lab waits for his blood. Although the antibodies he carries are the world’s last, best hope for a vaccine, he hides a dark secret that threatens them all. With humankind’s survival at stake, the ragtag band embarks on a journey of survival across three thousand miles of rusted-out post-apocalyptic America.","title":"Z Nation","banner":"http:\/\/thetvdb.com\/banners\/_cache\/graphical\/280494-g.jpg","fanart":"http:\/\/thetvdb.com\/banners\/_cache\/fanart\/original\/280494-14.jpg","poster":"http:\/\/thetvdb.com\/banners\/_cache\/posters\/280494-4.jpg"}]